[
  {
    "id": "3ccb1835-0c2a-442a-9529-b3592f4449fb",
    "photo": "https://terrigen-cdn-dev.marvel.com/content/prod/1x/293aer_com_mas_dsk_03.jpg",
    "name": "MELODY GUTHRIE\nAERO",
    "infos": {
      "height": "None",
      "weight": "None",
      "eyes": "None",
      "hair": "None"
    },
    "bio": "None"
  },
  {
    "id": "21ce0aaa-8d18-41a4-9302-d471c6c6d7e1",
    "photo": "https://terrigen-cdn-dev.marvel.com/content/prod/1x/agent1.jpg",
    "name": "CHRISTOPH NORD\nAGENT ZERO",
    "infos": {
      "height": "6'3\"",
      "weight": "230 lbs.",
      "eyes": "Blue",
      "hair": "(Originally) Brown; (currently) Black"
    },
    "bio": "Born in the former East Germany, Christoph Nord was an idealist who fought against the communist regime as a freedom fighter for the West German Cell Six. Nord’s brother Andreas fought for the East Germans, and when the two met in battle Nord was forced to kill his brother. Later, after an encounter with an assassin called the Confessor, Nord was recovering in a German hospital where he fell in love with nurse Ginetta Barsalini. The two married, and she soon fell pregnant, but he later learned that she was a double agent and was forced to kill her after she attacked him. Guilt and pain drove him further into his mercenary work, and he eventually accepted an offer to join the Central Intelligence Agency’s Weapon X Program. Nord joined the Program’s covert operations unit Team X, changed his name to David North, and took the codename Maverick.\n\nIn recent years, Japanese crimelord Matsu’o Tsurayaba and his allies, including former Weapon X scientist Doctor Cornelius, resurrected the Russian super-soldier Omega Red. In order to stabilize his mutant power, Omega Red required the Carbonadium Synthesizer, a device stolen from him by Team X decades earlier. Omega Red captured Maverick’s former Team X teammate Wolverine, who had the location of the C-Synthesizer buried in his memory, and several of Wolverine’s teammates in the X-Men. Maverick was hired by former Team X liaison Major Arthur Barrington to prevent Omega Red from obtaining the device, and he tracked another former Team X member, Sabretooth, to Omega Red’s location. With Maverick’s help, the X-Men were able to defeat the villains, and he subsequently killed Cornelius in an act of revenge.\n\nBarrington later sent Maverick to recover documents known as the Xavier Files, after the father of the X-Men’s telepathic founder, Professor Charles Xavier. The files were in the possession of a former colleague of Xavier’s father, Doctor Alexander Ryking, who was under the protection of the superhuman mercenary Warhawk. During the ensuing clash, Warhawk exploded, killing Ryking and seemingly destroying the files.\n\nMaverick was then assigned by the U.S. Government to protect Aldo Ferro, a former Weapon X ally. Maverick’s former Team X alumni sought Ferro after one of their number, Mastodon, died when his age suppression factor was seemingly reversed. Unbeknownst to Team X, Ferro was responsible for secretly implanting them all with false memories during their time with Weapon X. After Ferro betrayed Maverick, he sided with his former teammates against Ferro who was seemingly killed in the subsequent battle.\n\nMaverick next sought to hunt down Sabretooth to make him pay for his numerous crimes, and joined forces with the X-Men in capturing him. Maverick subsequently learned that he had contracted the deadly mutant-killing Legacy Virus. He asked Wolverine to kill him in order to avoid prolonged suffering, but Wolverine refused and Maverick came to form a sibling-like bond with another Virus sufferer, Chris Bradley.\n\nDuring the final stages of his infection, Maverick encountered the Russian mutant telepath Elena Ivanova who was hunting Sabretooth to avenge his murder of her mother. The Virus claimed Maverick’s life, but Ivanova managed to use her powers to coax him back to life. As a result, Maverick’s Legacy Virus went into full remission and his powers further mutated.\n\nMaverick was then captured by Russian crimelord Ivan Pushkin, whose scientists implanted false memories into Maverick’s mind to make him believe that Barrington had been responsible for his wife’s betrayal. Pushkin intended for Maverick to kill Barrington to prevent him from providing testimony that threatened Pushkin’s financial interests. Maverick located Barrington’s safehouse but was opposed by members of the Canadian super-team Alpha Flight. Maverick overcame Pushkin’s mental manipulation, however it was too late to save Barrington from Pushkin’s agents, Hammer and Sickle.\n\nIn a later encounter with Hammer and Sickle, Maverick’s left eye was gouged out by Sickle, and he was left to die in the Swiss Alps. Forced to cauterize the wound to stop from bleeding to death, Maverick survived and later resurfaced to aid Wolverine against a revived Weapon X Program. This new Program sent Sabretooth to recruit both Maverick and fellow Team X alumnus John Wraith. Neither accepted the offer, and so Sabretooth killed Wraith and critically injured Maverick. Brought to the Program with only minutes to live, Maverick reluctantly joined in order to survive and was genetically modified to become Agent Zero.\n\nAlthough an efficient operative, Zero hated what he had become and frequently considered suicide. On his first assignment as Zero, he was sent to assassinate Wolverine in an attempt by the Director to further break his spirit. Deliberately missing his target, Zero was punished with an electric shock. Later, Zero recaptured Sabretooth after his betrayal of the Program and would have killed him had the Director not shocked him again.\n\nAfter a change in leadership of the Program, Zero was assigned to track the anti-human terrorist group Gene Nation that had been revived by former Weapon X operative Marrow. Confronting her, Zero learned that her latest recruit, a man using his former identity of Maverick, had been sent to attack New York’s Grand Central Station. Confronting the impostor, Zero inflicted a fatal wound upon him only to learn that it was his friend, Chris. Zero then set about the task of wiping out Gene Nation with new zeal, although he declined to make Marrow a martyr. Returning to an abandoned Weapon X facility, Zero’s investigations led him to join Wolverine and the enigmatic mercenary Fantomex in opposing the Project’s original founder, John Sublime."
  },
  {
    "id": "4bf17d92-3dcc-4bd3-b4b6-f812b07c3c58",
    "photo": "https://terrigen-cdn-dev.marvel.com/content/prod/1x/adversary_head.jpg",
    "name": "ADVERSARY",
    "infos": {
      "height": "(As Naze) 5'11\"; (in true form) approximately 12'",
      "weight": "(As Naze) 180 lbs.; (in true form) Inapplicable",
      "eyes": "White",
      "hair": "(As Naze) Black; (in true form) None"
    },
    "bio": "The Adversary is an ancient mystical entity, possibly demonic in nature, who seeks to destroy the present universe and to create a new one in its stead. The Cheyenne Indians also refer to the Adversary as the 'Great Trickster', for the Adversary uses deception and trickery in attempting to achieve his goals. His native dimension is one of chaos, which the Adversary loves and seeks to spread to Earth's dimension, overturning order for the mere sake of doing so. The Adversary regards himself as a gamester, toying with the fate of the cosmos for sheer enjoyment. In his true form, the Adversary is not composed of physical matter; hence he can be fought successfully through magic but not through most forms of physical force. The Adversary is, however, known to be vulnerable to harm by cold iron, and hence to both steel and Adamantium.\n\nThe Cheyenne Indians have long known of the existence of the Adversary, and their shaman, the mutant technosmith Forge, was trained from birth to combat him. Forge's teacher was the older Cheyenne shaman Naze, who himself once clashed with the Adversary. However, Forge rejected the life of a shaman and instead enlisted in the United States armed forces. Years later, Naze was killed by a member of the alien Dire Wraiths, who duplicated his form. That Wraith, in turn, fell under the mystical possession of the Adversary. The false Naze convinced the then-powerless X-Man Storm that Forge had fallen under the influence of the Adversary and was attempting to destroy the Earth. The false Naze accompanied Storm to the mountain in the Western United States that was the \"heart of his magic\". The false Naze had Storm go up the mountain to stop Forge, claiming that he could not go himself since Forge had set mystical alarms and defenses against him. Storm fought off the demons that attacked her and then stabbed Forge, only to learn that he was actually attempting to close the dimensional gateway through which the demons were coming. Forge and Storm both fell through the gateway and were transported to the Earth of a parallel dimension on which apparently no other human beings existed. Thus the Adversary had rid himself of the two people he regarded as the only real threat to his plans to destroy and remake the universe. He offered them the chance to become the \"world spirits\" of the new Earth he planned to create, and to be the parents of its new human race.\n\nThe Adversary had, by now, captured Roma, the goddess who acts as the guardian and caretaker of the known dimensions and held her prisoner within her own Starlight Citadel. Forge restored Storm's ability to use her superhuman powers and they escaped the world to which they had both been exiles, only to be captured by the Adversary. On Forge's native Earth, the Adversary had jumbled elements of many different time periods at Forge's Eagle Plaza headquarters. The X-Men fought against the resulting chaos while their actions were televised across the world by reporter Neal Conan. The X-Men, their ally Madelyne Pryor, and Conan were all transported to the Starlight Citadel where they distracted the Adversary, who had abandoned Naze's form and revealed his true appearance, whilst Forge and Storm regained their freedom. The X-Men and Pryor willingly agreed to sacrifice their lives so that Forge could cast the spell needed to defeat the Adversary. In casting the spell, Forge transformed the X-Men and Pryor into beings of pure energy which he then gathered together and hurled at the Adversary, forcing him through a mystical portal known as the Great Gate which closed on him. According to Forge, the deaths of the X-Men and Pryor had assured that the Adversary would be sealed away for all time. However, Roma then used her great powers to return the X-Men and Pryor to life. Roma explained that the Adversary must not be thus confined forever, since through the chaos he brings can come positive change and growth.\n\nThe Adversary returned once more thanks to the seer named Haven, who was pregnant with a sentient mutant foetus. The Adversary used the foetus as a vessel with which to rematerialize in the mortal realm, killing Haven in the process. The Adversary was defeated by Forge once more after the mutant reclaimed his mystic heritage and combined it with his technological prowess."
  },
  {
    "id": "6e8031df-7af0-45d0-8059-0ced4a107548",
    "photo": "https://terrigen-cdn-dev.marvel.com/content/prod/1x/233aeg_com_crd_01.jpg",
    "name": "LADY OF ALL SORROWS\nAEGIS",
    "infos": {
      "height": "Variable",
      "weight": "Variable",
      "eyes": "White",
      "hair": "Variable"
    },
    "bio": "The complete history of Aegis is unknown. She has existed in this universe since its infancy. She is a proemial being. It is said that she prepared what exist for what is to come, by eliminating early lifeforms such as the Chaos Mites. It is documented that ages ago she was known and feared as Aegis (Lady of All Sorrows). Time has erased nearly all of her evil. In an early battle of the Gods Tenebrous and Aegis were among the only remaining survivors of a brutal battle with Galactus. They were imprisoned in the prison planetoid known as the Kyln by the World Devourer Galactus. The Kyln is located at the edge of the universe in a sector known as the Crunch Cascade. They remained locked in there for centuries.\n\nUnfortunately it was through the Crunch Cascade that the Annihilation Wave started its invasion of the positive universe. The wave did irreparable damage to the Kyln, and Aegis and Tenebrous were released back into the living universe once more, adding further fuel to the chaos that was engulfing all life. They were two other former powerful inmates freed from the Kyln, Kosmos the Maker formerly the Beyonder, and the Fallen One first Herald of Galactus. After Tenebrous captured and drained the Fallen One of his power, leaving him as a lifeless husk. Thanos of Titan came to the rescue of the Fallen One. Aegis noticed a small winged woman on the shoulder of Thanos. She stated that she was indeed a Chaos Mite. Aegis was puzzled as to how the Mite (Skreet) had managed to escape the great purge. Skreet refused to reveal her secrete.\n\nleftAegis and Tenebrous confronted Galactus and his newly restored Herald the Silver Surfer in battle. Galactus and the Silver Surfer were easily defeated and left for Thanos to strip them of the Power Cosmic. Thanos who had struck and alliance with Annihilus of the Negative Zone. Thanos worked diligently to remove the Power Cosmic. Tenebrous and Aegis disappeared into the cosmos. They later returned to the ruins of the Kyln hoping to find the other Proemial Gods, which could have also been prisoners there. To their disappointment they found the fallen body of Antiphon the Overseer. He had apparently fell victim to the destruction of the Kyln. The Silver Surfer who had escaped captivity tracked down the two Gods. He defeated them by using the powers of the Crunch to destroy them once and for all."
  },
  {
    "id": "c67f2ecf-4e6d-4b73-a361-3ae0bb7d1b7f",
    "photo": "https://terrigen-cdn-dev.marvel.com/content/prod/1x/adaptoids.jpeg",
    "name": "ADAPTOIDS\nADAPTOID",
    "infos": {
      "height": "Variable",
      "weight": "Variable",
      "eyes": "Variable",
      "hair": "Variable"
    },
    "bio": "In custody of S.H.I.E.L.D., the Super-Adaptoid was being taken to Holding Facility Number 7. However during transport the creators of the Adaptoid, A.I.M., bombed the escort and captured the Adaptoid, taking him to an undisclosed island in the Phillipines. From there the scientists of A.I.M. worked diligently to mass-produce its abilities, however something went wrong and an explosion occured. In the explosion hundreds of thousands of Adaptoids were spawned from the original. Awakened from the explosion the Adaptoid now ordered these new Adaptoids to take over the A.I.M. base. The members of A.I.M. then sent out a distress signal in hopes of help arriving.\n\nHearing of the alert, S.H.I.E.L.D.'s Nick Fury ordered the Avengers to investigate. When the Avengers arrived on the island the Super-Adaptoid ordered his \"children\" to attack them. The newly formed Adaptoids swarmed around the Avengers hoping to overpower them with sheer numbers. However the then team leader Goliath ordered his team to find the Super-Adaptoid while he face against the majority of the Adaptoid spawn. During this fight hundreds or perhaps thousands of Adaptoid spawn attacked Goliath at once, but somehow Goliath defeated them all while his team tried to find the Super-Adaptoid which had already fled from the island.\n\nSometime later the Super-Adaptoid formed a group called Heavy Metal, a group of robots and androids united to destroy the Avengers. Soon after its formation the team faced off against the Avengers on Hydrobase, where the Super-Adaptoid met with his \"brother\" Kubik. Since the Adaptoid was made from a piece of the Cosmic Cube, he copied the powers of his \"brother\" which also originated from the Cosmic Cube and gained limitless power. Deciding to use this power to turn the Earth's inhabitants into Adaptoids themselves he created another batch of Adaptoid spawn. These spawn copied the appearances and powers of several Avengers including Captain America, Doctor Druid, Namor, and others. However when captured Doctor Druid tricked the Super-Adaptoid and caused his defeat. After his defeat the Adaptoid spawn simply disappeared.\n\nLater the Super-Adaptoid, posing as Alessandro Brannex, the leader of A.I.M. created many more Adaptoids with the ability to copy only one person's form and powers. These Adaptoids went up against the Avengers. However due to an immense explosion all these Adaptoids were destroyed."
  },
  {
    "id": "c6787a89-152c-4d90-ae67-428c70f344d4",
    "photo": "https://terrigen-cdn-dev.marvel.com/content/prod/1x/a_head.jpg",
    "name": "CLAIR MOORE\nA",
    "infos": {
      "height": "Unrevealed",
      "weight": "Unrevealed",
      "eyes": "Unrevealed",
      "hair": "Blonde"
    },
    "bio": "The woman known only as A is one half of the mercenary duo known as the Lady Killers. A and her partner T assisted\nMister X\n's bodyguard Blok in testing\nWolverine\nprior to the feral X-Man's meeting with Mister X."
  },
  {
    "id": "c5226bc6-351b-4c5c-a87b-b24629190dab",
    "photo": "https://terrigen-cdn-dev.marvel.com/content/prod/1x/3dman442.jpg",
    "name": "CHARLES CHANDLER & HAL CHANDLER\n3-D MAN",
    "infos": {
      "height": "6'2\"",
      "weight": "200 lbs.",
      "eyes": "(Hal) Brown, (Chuck) Blue, (3-D Man) Obscured by red/green goggles",
      "hair": "(Hal) Gray, (Chuck) Reddish-blonde, (3-D Man) Unrevealed"
    },
    "bio": "The 3-D Man was a 1950's hero who came about through the unique merger of two brothers, Hal and Chuck Chandler. Chuck was a test pilot who was abducted by alien Skrulls during an important test flight. Earth was seen as a strategic location in the ongoing conflict between the alien Kree and Skrull Empires, so the Skrulls were seeking information on Earth's space program and had captured Chuck to interrogate him. Chuck resisted and escaped, accidentally causing the explosion of the Skrull spacecraft in the process. While his brother Hal watched, the radiation from the explosion seemingly disintegrated Chuck, who disappeared in a burst of light. Hal later discovered, however, that the light burst had imprinted an image of Chuck on each lens of Hal's eyeglasses. Through concentration, Hal could merge the images and cause Chuck to reappear as a three-dimensional man. Chuck become the costumed adventurer known as the 3-D Man and single-handedly subverted the Skrulls' early attempts to undermine Earthly civilization.\n\nHal would remain comatose whenever the 3-D Man was active but remained aware of the 3-D Man's activities through a mental link. Later, a Skrull's ray weapon altered the transformation so that Hal was the 3-D Man's dominant consciousness for some time. Both brothers' minds seemed to be present in the 3-D Man at all times, but only one of them (usually Chuck) would be in conscious control of the 3-D Man's form on any given occasion.\n\nAfter a brief career as a costumed adventurer, Hal decided to retire the 3-D Man, partly because he was thinking about starting a family, and partly because he was afraid his brother's consciousness might somehow be lost during periods when Hal was the 3-D Man's dominant consciousness. Hal settled down into a career as a research scientist, got married to Chuck's former girlfriend, and raised two sons. He had only activated the 3-D Man twice in recent years, once to fight a rampaging Hulk. During this time as 3-D Man, Chuck seemed to be its dominant consciousness again.\n\nMore recently, Hal began to feel a strange impulse to travel to the Himalayan Mountains of India. Unbeknownst to him, the presence of a powerful mystical artifact was calling to him. The artifact was a pyramid-shaped shard of light, one of three such shards that were created by the universe in reaction to the presence of pure evil that was cast adrift in this dimension by the extradimensional gods known as the Trion. One of these shards was captured by the Skrulls who had abducted Chuck Chandler, and its energies had merged with Chuck in creating the 3-D Man.\n\nChandler also heard the call of the other shard and mounted an expedition to find it. He was betrayed, however, by Jonathan Tremont, one of the expedition's guides, who claimed the shard for himself. Hal was held captive by Tremont for many years, and Tremont used the power of his shard to create the religious organization called the Triune Understanding. Tremont had discovered the true origin of the shards and hoped to use the Understanding to end the threat of the Trion's cast-off evil, which he termed the \"Triple-Evil.\"\n\nTremont also sought out alternate weapons against the Triple-Evil. He used the power of the shard that was internalized in Hal Chandler to release the powers within a new follower, Delroy Garrett Junior, creating the superhuman champion Triathlon. Triathlon unknowingly held the essence of both Hal and Chuck within himself.\n\nUltimately, Tremont and the hero team Avengers (which now included Triathlon among their members) fought the Triple-Evil and the aliens it had corrupted. Tremont sensed that he might overwhelm the power of the Triple-Evil, to use it for himself to become as a god, and then to reward himself with dominion over all the Earth. Instead, Triathlon found the remaining third shard and, coupling it with the power within him as personified in the 3-D Man, he wrested control of the shard used by Tremont. Using all three shards, a Triathlon/Hal Chandler/Chuck Chandler amalgamation emerged and was able to destroy the Triple-Evil.\n\nTriathlon/3-D Man used the pyramid that once housed the Triple-Evil to return the Avengers to Earth, which had since been conquered by the time-traveling Kang. They used the power of the pyramid, channeling the energies of all those fall to its assault for millennia, to fight back and ultimately Kang was defeated.\n\nTriathlon returned to Peggy Chandler, separating himself from Hal and Chuck and restoring both of them to physical form. Triathlon found his triple-powers had remained, although Hal and Chuck no longer possessed the power to transform into 3-D Man.\n\nNote: In at least one timeline, a team of adventurers known as the Avengers briefly formed in the 1950's before disbanding at the request of the President, who felt the public wasn't ready to learn of them and their exploits. The 3-D Man was part of that short-lived Avengers team, and their rescue of the President from Yellow Claw helped dispel the 3-D Man's reputation as a dangerous outlaw thanks to the President's influence."
  },
  {
    "id": "92cb7034-3875-4365-a873-07948b67f802",
    "photo": "https://terrigen-cdn-dev.marvel.com/content/prod/1x/abraxas442px.jpg",
    "name": "ABRAXAS",
    "infos": {
      "height": "Variable",
      "weight": "Variable",
      "eyes": "Blue",
      "hair": "Black with gray streaks"
    },
    "bio": "Abraxas, as the antithesis of Eternity and the abstract embodiment of destruction, sought to destroy not only the main Marvel Comics universe, known as Earth-616, but all parallel realities as well using a weapon of universal destructive power called the Ultimate Nullifier. The location of the Ultimate Nullifier was unknown except to the Human Torch, a member of the super hero team the Fantastic Four. With the intention of attracting the attention of the Fantastic Four, Abraxas killed another universe's Galactus, and sent his skull to Earth-616, also using the skull as a homing beacon. This caused a disturbance in the space-time continuum, allowing people from other universes to come through the gap left by the head, including another Nova (Frankie Raye). When the Fantastic Four sought the counsel of the Watcher, they found that he had forgotten who he was, and then he became comatose. Eternity told Mister Fantastic of the Fantastic Four that this was caused by Abraxas.\n\nAfter Mister Fantastic gathered a selection of superheroes to fight the minions of Abraxas on the moon (the home of the Watcher), the Silver Surfer was killed by a mist of micro-organisms as he attempted to defend the Watcher from them. The minions seemed to seek the Human Torch, and after investigation it was discovered that he possessed the coordinates of the Ultimate Nullifier. However they were not only within the mind of their Human Torch, but split between the minds of three other Human Torches in alternate universes.\n\nAfter finding these alternate Human Torches, and passing on the information to the Human Torch of Earth-616, the Fantastic Four found the Ultimate Nullifier. However they were betrayed by the alternate version of Nova, who worked for Abraxas. Abraxas then seemingly destroyed Roma, the protector of Eternity.\n\nAfter Nova gave Abraxas the Ultimate Nullifier, a battle commenced which the Fantastic Four were losing. However Franklin Richards, Mister Fantastic's son who possessed powers that enabled him to warp reality, and Valeria von Doom pooled their powers and revived Galactus from his star-like remains, though the siblings burned out their powers in the act. The newly reformed Galactus then recalled the Ultimate Nullifier from Abraxas' grasp, revealing to all present that the Ultimate Nullifier was actually a part of his being. Due to interference from Nova the Ultimate Nullifier fell to Mister Fantastic, who realised that the only way to destroy Abraxas was to destroy the whole of reality and recreate the multiverse using the Nullifier. After he does so, those who had died, including the Silver Surfer, were brought back to life, Franklin Richards was left without any power, Valeria is replaced with a new baby inside the womb of the Invisible Woman, and the Watcher was returned to normal."
  },
  {
    "id": "c9ccb5fe-98ba-494a-9157-b1e1b44f98f4",
    "photo": "https://terrigen-cdn-dev.marvel.com/content/prod/1x/aegis-headshot.gif",
    "name": "TREY JASON ROLLINS\nAEGIS",
    "infos": {
      "height": "6'",
      "weight": "180 lbs.",
      "eyes": "Brown",
      "hair": "Brown"
    },
    "bio": "Trey Rollins grew up in a rough Brooklyn neighborhood, avoiding the local street gangs and concentrating on his study of classical mythology. His close friend James once pushed Trey to safety during a drive-by gang shooting, but James himself would later join the street gang Lobo's Boys. On his way home from school one afternoon, the teenage Trey heard a strange noise coming from an abandoned building. Inside, Trey found a mystical breastplate he recognized as the Aegis, the legendary Medusa-faced shield of the Greek goddess Athena. Using the breastplate, Rollins became a masked crime-fighter as Aegis, winning the admiration of locals, including young graffiti artists Lester and Payton. After helping the New Warriors defeat the alien menace Blastaar, Aegis was awarded Warriors membership. However, the Warriors in general and Nova in particular were slow to trust the inexperienced Aegis, partly because he was the only member of the group who insisted on concealing his secret identity from the others.\n\nWhen Brooklyn-area street gangs began wielding high-tech A.I.M. weapons, the Warriors set out to stop the gang war and cut off the weaponry supply. Aegis repeatedly protected James during this conflict, but an ungrateful James nearly killed the Warriors several times over. He also threatened to expose Trey's dual identity, and helped Lobo's Boys destroy the Warriors' Crashpad headquarters. The Warriors eventually nailed the arms dealer supplying the gangs, organized crime boss Joseph Manfredi, and defeated his armored enforcers Heavy Mettle. James fled into hiding after killing a member of the rival Born 2 Die gang during a scuffle. Trying to explain his ties to James, Trey finally shared his true identity with the Warriors and began to bond with the team. When the Greek demigod Hercules mistakenly accused Trey of stealing the Aegis, the goddess Athena revealed that she had left it for Trey to find as a gift, and declared Trey her newest mortal champion. With the support and blessing of Athena and the other Olympian gods, Trey found new confidence as a hero. However, Aegis has been seldom seen of late, perhaps because he needs to keep his school grades up if he hopes to qualify for a college scholarship."
  },
  {
    "id": "5faf0367-1a96-4eb0-b2ec-58528480e999",
    "photo": "https://terrigen-cdn-dev.marvel.com/content/prod/1x/aftershock.jpg",
    "name": "ALLISON DILLON\nAFTERSHOCK",
    "infos": {
      "height": "Unrevealed",
      "weight": "Unrevealed",
      "eyes": "Green",
      "hair": "Brown"
    },
    "bio": "Max Dillon, the costumed criminal known as Electro, loved a woman named Marilyn. She \"had more sense\" than to marry a criminal like him. She did, however, have a child with him. She was named Allison. Max always loved Allison, and he only wanted the best for her. However, being a professional criminal, he was always in jail, and Allison went from foster home to foster home. Since their electrical auras were slightly different, the slightest touch would cause them intense pain. When Max Dillon found out that his daughter was following in his footsteps, he asked\nSpider-Man\nfor help. Spider-Girl, Spider-Man, and the Avengers teamed up to stop Aftershock. They eventually overcame their pain, and Max promised to be a loving father to her. Whether or not he has fulfilled his promise remains to be seen."
  },
  {
    "id": "724bc719-0630-4e0d-ba6e-952761eec91e",
    "photo": "https://terrigen-cdn-dev.marvel.com/content/prod/1x/875aga_com_mas_dsk_02.jpg",
    "name": "AGATHA HARKNESS",
    "infos": {
      "height": "None",
      "weight": "None",
      "eyes": "None",
      "hair": "None"
    },
    "bio": "None"
  },
  {
    "id": "873bd4a4-f9cd-49cc-9562-5967bcffbd9d",
    "photo": "https://terrigen-cdn-dev.marvel.com/content/prod/1x/agentx01.jpg",
    "name": "NIJO (FULL NAME UNREVEALED)\nAGENT X",
    "infos": {
      "height": "6'",
      "weight": "215 lbs.",
      "eyes": "Brown",
      "hair": "(Currently) None; (originally) black with white stripe"
    },
    "bio": "Originally a partner of the mind-altering assassin Black Swan, Nijo spied on Deadpool as part of the Swan's plan to exact revenge for Deadpool falsely taking credit for the Swan's assassination of the Four Winds crime family, which included Nijo's brother. Nijo was killed by the Swan after refusing to kill Deadpool's assistant, Sandi Brandenberg. Confronted by Deadpool, the Swan's powers flared out of control, telepathically linking their minds and mixing traits and abilities before the bomb detonated. Now sharing Deadpool's healing factor, Nijo was resurrected, but with no memory of his identity or past except for a burning ambition to become the world's best mercenary. He instinctively sought out Sandi, who took him in due to his resemblance to Deadpool. He named himself Alex Hayden after the composers Alexander Grieg and Josef Haydn, Sandi enlisted the help of her mercenary boyfriend Taskmaster and the gunslinger Outlaw for Hayden's training, creating within him a combination of Deadpool's and the Swan's skills.\n\nAlex and Sandi formed the Agency X mercenary service, and were paid for their first job with a run-down amusement park. With Agency X, Alex romanced Outlaw and entered a challenge to steal the Punisher's guns. He also encountered the young mutant Mary Zero, whose power prevented everyone except Alex from noticing her existence. Alex also roughed up the creator of Internet pop-up ads, hired Arcade to upgrade the amusement park, and clashed with the Four Winds and their new leader, Higashi. In a showdown at the park, Alex and his allies battled super-criminals hired by the Four Winds. Despite overwhelming odds, Alex and the others survived and made peace with Higashi; but only after he hired Alex to eliminate his troublesome lieutenant.\n\nSandi briefly romanced Alex while they were on an assignment to kill retired super-hero Fight-Man. Alex was then confronted by Deadpool and the Black Swan, who proposed they restore their original selves. During the transfer, the Swan betrayed them and absorbed their powers. Aided by Taskmaster, Outlaw, and hired guns from the Four Winds, Alex and Deadpool killed the Swan after stretching his newfound powers past their limit. Reforming Agency X, the mercenaries went on vacation with the Black Swan's stuffed corpse.\n\nLater, Alex was hired to prevent Deadpool from restoring the mind of Cable, who had become a would-be world savior. He was ultimately unsuccessful."
  },
  {
    "id": "48588b6e-bc68-43d3-bb0f-eeecc7a05d38",
    "photo": "https://terrigen-cdn-dev.marvel.com/content/prod/1x/aggamon.jpg",
    "name": "AGGAMON",
    "infos": {
      "height": "6'6\"",
      "weight": "234 lbs.",
      "eyes": "Green",
      "hair": "None"
    },
    "bio": "For at least a millennium Aggamon had ruled the Purple Dimension, from which he tricked natives of other dimensions into entering his realm and he forced them into slavery in his mystic gem mines. In recent years, two thieves stole Doctor Strange's Purple Gem, which transported them to Aggamon's dimension. Strange, sworn to protect all humankind, confronted Aggamon, who offered to return the men in exchange for Strange's servitude. Strange agreed, but once the thieves were freed, he declared he would leave servitude and challenged his opponents to a mystic duel. The two sorcerers were stalemated for hours, eventually weakening their life forces until Aggamon, unwilling to risk his life, surrendered. Revealing he had cast a spell preventing Aggamon's full recovery unless he freed his remaining slaves, Strange then returned to Earth with the two thieves. The two thieves moved by the experience, turned themselves over to police custody.\n\nLater, while Doctor Strange was fighting his second battle against Dormammu, Aggamon was one of several rulers of extra-dimensional realms who witnessed the event. He also sold his gems to sorcerers throughout the multiverse which were used to focus, store, and/or amplify mystic energy. Clea also extorted Aggamon into helping her reclaim he role as ruler of the Dark Dimension."
  },
  {
    "id": "c9fccac4-0fe5-43f8-b950-4b12c3225bc3",
    "photo": "https://terrigen-cdn-dev.marvel.com/content/prod/1x/agegen.jpg",
    "name": "UNREVEALED\nAGED GENGHIS",
    "infos": {
      "height": "5'4\"",
      "weight": "84 lbs.",
      "eyes": "Brown",
      "hair": "Bald (white facial hair)"
    },
    "bio": "Allegedly the oldest living human sorcerer, the future Genghis established a pact with virtually omnipotent mystic principalities, the Vishanti, shortly after the dawn of humanity. In exchange for knowledge, he would assemble the world's greatest mystics every century, presiding over a contest for the role of Sorcerer Supreme. Reportedly extending his life via the Pool of Blood, he performed his duty for untold millennia. For centuries he has dwelled in a Tibetan cavern in the foothills of the Himalayas, watched over by manservants. His mind long ago consumed by mystic forces swirling about reality, his original name lost to the eons, he became the Aged Genghis. Many travelers sought his training, but most, if not all, were turned away. Some twenty years ago he was approached by the freshly scarred Victor von Doom; refusing to train Doom even after a beating, Genghis instead referred him to an order of monks who would guide him to his destiny. Dr. Strange found and nursed the Genghis back to health after the attack.\n\nMore recently, Dr. Strange sought the Genghis' aid in locating Eternity to save the Ancient One, but the senile wizard instead gave him a scroll that transported Strange to the Netherworld of Eternal Doom. There Strange faced the Demon of the Mask. Further efforts by Dr. Strange, Clea, and others to gain the Genghis' aid met with similar frustration. Strange was once nearly destroyed by the Genghis' madness given form when he tried to bring him to his New York Sanctum Sanctorum for better care.. During moments of greater clarity, the Genghis referred would-be disciples to Strange. Allegedly Jefferson Archer, the future Highwayman, was among those refused by the Genghis. When the Time of the Vishanti arrived, Genghis briefly regained his wits and summoned the sorcerers of Earth to the Temple of the Three in the Javan Rainforest of South East Asia. Dr. Strange won the contest, but was forced to grant a boon to the runner-up, Dr. Doom. This lead to Doom and Strange rescuing Doom's mother, Cynthia, from the clutches of the Hell-lord Mephisto."
  },
  {
    "id": "54d5521c-ecac-46a5-9c0f-2a22bbb36e84",
    "photo": "https://terrigen-cdn-dev.marvel.com/content/prod/1x/aberration.jpg",
    "name": "RANA PHILIPS\nABERRATION",
    "infos": {
      "height": "Unrevealed",
      "weight": "Unrevealed",
      "eyes": "Green (as Philips); Green (as Aberration)",
      "hair": "Brown (as Philips); Green (as Aberration)"
    },
    "bio": "Rana Philips enlisted in the U.S. Army and was assigned to Abu Fasaud Central Prison. She took part in the abuse of prisoners there, and her supposed fiancé, Sergeant Jeffrey Ivey was also allegedly involved, taking photos of the abuse although never appearing in them. After telling Philips he was leaving her for another woman, she shot and killed him. At her court martial, Philips was sentenced to death, but General John Ryker freed and transformed her, using DNA from the Abomination, into a superhuman powerhouse. As Aberration she was given a place on Ryker's Gamma Corps: Black.\n\nAberration and her teammates, Axon and Morass, were assigned to abduct Lyra, the Hulk (Bruce Banner)'s daughter from an alternate future, to be brought back to the Origins Corporation for genetic harvesting, and seize Lyra's Boudicca; a sentient technological device which stole information belonging to Norman Osborn. Lyra escaped from the initial confrontation, seemingly killing Morass, and Aberration and Axon fled. Between dehydration from hiking for hours through the desert and being drained of her energy to replenish Axon's depleting stores, Aberration was on the verge of collapse until discovering a town. Storming a small shop after mauling a few bikers, Aberration drank until her strength was restored. Using the remaining townspeople as bait, she lured Lyra out into the open and attacked. Caught in an explosion after Lyra threw her into a fuel pump, Aberration's body attempted to rapidly replace all the burnt tissue, forming massive cancerous growths and extra appendages, leaving her horribly disfigured. Lyra then drove a large metal pole through her brain, apparently killing her."
  },
  {
    "id": "1ce034cd-4120-481c-81cf-a4159203fd0d",
    "photo": "https://terrigen-cdn-dev.marvel.com/content/prod/1x/administrator442.jpg",
    "name": "UNREVEALED\nADMINISTRATOR",
    "infos": {
      "height": "Unrevealed",
      "weight": "Unrevealed",
      "eyes": "None",
      "hair": "None"
    },
    "bio": "The Administrator is the leader of the Watchtower, a secret organization that seeks to \"heal a sick world\" by means of their anti-mutant medical research facility.\n\nThe Administrator employed Deadpool to lead the Watchtower's superhuman strikeforce known as The Scourge to apprehend Wolverine, whom the Watchtower wanted for his healing factor. Subsequently, the Watchtower learned of the threat of the Skornn which posed a hazard to both mutant and humankind. The Watchtower sought to use mutant bloodhounds to ferret out the Skornn before they hatched; however, the Watchtower's facility was infiltrated by Wolverine and Cable's X-Force. Wearing a battlesuit, the Administrator faced Wolverine but was killed by an alternate future version of Domino."
  },
  {
    "id": "98bb1e9e-91ce-4449-b4fb-737bc17f80e3",
    "photo": "https://terrigen-cdn-dev.marvel.com/content/prod/1x/8-ball.jpg",
    "name": "JEFF HAGEES\n8-BALL",
    "infos": {
      "height": "5'10\"",
      "weight": "175 lbs.",
      "eyes": "Blue",
      "hair": "Red"
    },
    "bio": "Jeff Hagees was once a designer of missile propulsion systems for a defense contractor. To cope with the stress of his job, he turned to gambling, losing thousands in pool rooms. When he fell into serious financial jeopardy, his employers took notice of his gambling problem, and fired him, fearing he was selling defense secrets to pay his debts. Furious, he designed the costumed identity of 8-Ball, basing his custom pool cue on his propulsion system work. He organized a gang of henchmen and went on a crime spree in New York city to make his fortune.\n\nHe has encountered many heroes in his time ranging from Sleepwalker to She-Hulk to the Avengers, many of which ended with 8-Ball's incarceration. However, his biggest mistake was when he decided to pull a heist with three partners - Freezer Burn, Humbug and Whirlwind - to rob the publishing mogul, Ricadonna. Unaware Ricadonna was really an up and coming crime figure with a lot of connections, 8-Ball and company inadvertently stole a one-of-a-kind microchip worth billions, and she would do anything to get it back. When Misty Knight and Colleen Wing came looking for him because of a warrant for his arrest, 8-Ball told them he stole to pay for his elderly grandmother's nursing home. That story may have slightly tugged at their heart strings, but Ricadonna hired the Wrecker to take him out - which he did by blowing up the car he was in."
  },
  {
    "id": "fe35f970-27a2-4d08-8e77-7cb67d5529a2",
    "photo": "https://terrigen-cdn-dev.marvel.com/content/prod/1x/230acy_com_crd_01.jpg",
    "name": "ACROYEAR",
    "infos": {
      "height": "Unrevealed",
      "weight": "Unrevealed",
      "eyes": "None",
      "hair": "Bald"
    },
    "bio": "Acroyear is an inhabitant of the sub-atomic realm known as the Microverse. He was born on the planet of Spartak, where his father was king. As a young adult he joined the freedom fighters,\nArcturus Rann\n,\nBug\nand\nMarionette\nas protectors of the Microverse against the oppressive despot Baron Karza."
  },
  {
    "id": "f5c19e81-0d75-4d28-bee5-b46a2be5193c",
    "photo": "https://terrigen-cdn-dev.marvel.com/content/prod/1x/acotilletta2--adam_mann.jpg",
    "name": "ADAM MANN",
    "infos": {
      "height": "Unrevealed",
      "weight": "Unrevealed",
      "eyes": "Blue",
      "hair": "Gray"
    },
    "bio": "Adam Mann was raised by a single mother and never knew his father. As a boy, his head was filled with myths and legends of ancient gods through bedtime stories his mother read to him. As a man, he excelled in sports and went on to win more Olympic gold medals than any other athlete in history. His accomplishments were so great he was tested for the X-gene, but Mann was not a mutant. Gaining several endorsements, he made a financial fortune, and then built a business empire. He always suspected his father was an errant god like Hercules and began collecting ancient artifacts to harness their mystical energy, intending to amass so much energy that he could travel to places like Asgard or Olympus to find his father and slay him for abandonment.\n\nWhen Steve Rogers gave the Thunderstrike mace to Kevin Masterson, son of the heroic Thunderstrike (Eric Masterson), and Kevin called upon its power, Mann detected a new energy source to collect. He sent his private strike force to retrieve it which they did after a brief battle with Kevin and his Asgardian protector, Gruenhilda. Mann connected the mace to his Mysticator, a generator that supplied him with God Force, and donned his golden armor, which filled him with the power of a living god, as Kevin broke into his home to reclaim the mace. Mann fought Kevin (as Thunderstrike), blasting him through the chest with an energy beam that seemingly killed him, but once Thunderstrike transformed back into Kevin, his wounds were healed. Mann pursued Kevin to regain the mace but was interrupted by the villainous Mangog, unintentionally summoned to Earth by the Mysticator. Mangog questioned both combatants as to whether or not they were gods, and Mann acknowledged this claim with pride; soon discovering his error as Mangog announced he detested the gods and devoured Mann, armor and all.\n\nMann's claim to be a descendant of the gods was never proven."
  },
  {
    "id": "54f22808-fe38-45cc-9c48-a593df5ba323",
    "photo": "https://terrigen-cdn-dev.marvel.com/content/prod/1x/achebe.jpg",
    "name": "UNKNOWN\nACHEBE",
    "infos": {
      "height": "6'",
      "weight": "190 lbs.",
      "eyes": "Brown",
      "hair": "Black"
    },
    "bio": "Reverend Doctor Michael Ibn al-Hajj Achebe's true identity remains unknown. Stories persist that he was originally a Ghudazian farmer until Ujankan guerillas took refuge in his home, repaying his hospitality by stabbing him repeatedly, burning his farm, and stealing his unfaithful wife. Refusing to die, the farmer sold his soul to the devil for revenge, hunting down and slaying everyone associated with his wife, from close family to casual acquaintances.\n\nThough that tale remains unconfirmed, Achebe did sell his soul to the demon Mephisto. Earning multiple degrees in America, he formed ties with rogue elements in the U.S. intelligence community. Ghudaza shared a border with the technologically advanced Wakanda, and Achebe's new allies saw him as a means to access restricted Wakandan information denied them by the the Wakandan king T'Challa, also known as the Black Panther. Achebe was repatriated, and through a complex series of deniable intermediaries, including Spectrum Dynamics, the Russian Mafia, and the Volcan Domuyan secret police, his allies instigated a bloody, ethnic civil war in Ghudaza. Thousands of refugees fled into Wakanda, Achebe included, and were housed in makeshift camps. T'Challa's decision to accept these outsiders angered many more insular Wakandans, while the refugees grew restless over the poor living conditions in the camps.\n\nT'Challa was aware that the situation had been engineered, but played along to draw his enemies into the open. Achebe's allies lured T'Challa to America by creating a scandal in the Wakandan-backed Tomorrow Fund charity, and Achebe led a coup in his absence. T'Challa's step-mother Ramonda agreed to share power with Achebe. Publicly this alliance was to halt the civil war; secretly, it was to spy on Achebe for T'Challa while appearing to betray her stepson. Achebe's secret U.S. backers lost control of him when T'Challa forced Mephisto to cut Achebe loose. This caused Achebe's insanity to worsen. Now taking advice from his hand puppet Daki, Achebe had T'Challa's fiancée kidnapped and turned into a human bomb. T'Challa rescued her, and rooted out Achebe's allies. Achebe responded by activating giant Panther \"Prowler\" robots designed to defend Wakanda's capital, turning them on the citizens. T'Challa returned to confront Achebe, who escaped disguised as the Black Panther after threatening to blow up the palace.\n\nAchebe went into hiding, briefly emerging to torture the renegade Dora Milaje Nakia (T'Challa's former ally). Months later, when T'Challa was deposed as Black Panther by Erik Killmonger, Achebe hired Deadpool and his allies to kidnap Killmonger's leopard companion Preyy. Achebe hoped that Deadpool would slay Killmonger, thus restoring Achebe's \"playmate\" T'Challa. When this failed, Achebe killed Preyy and went back into hiding."
  },
  {
    "id": "1c0c6166-95cd-49b8-8537-0ca2563ef69c",
    "photo": "https://terrigen-cdn-dev.marvel.com/content/prod/1x/agent.jpg",
    "name": "DANIEL SHOOK\nAGENT",
    "infos": {
      "height": "7'1\"",
      "weight": "315",
      "eyes": "Black",
      "hair": "Light Brown"
    },
    "bio": "A highly covert operative only accessible online under the codename \"The Agent,\" Rick Mason was a free-lance agent specializing in data on non-lethal handling of superhumans. His clients included American, British, Japanese, French, and Israeli government agencies, as well as international agencies such as S.H.I.E.L.D. Son of the criminal machinesmith Tinkerer, Rick grew up exposed to the latest technologies and their criminal users. He immersed himself in covert activities, working beside or studying under operatives including Nick Fury, the Cat (Shen Kuei), Teng Yun-Suan, Dennis Nayland and Alexi Vazhin. His solo defeat of the Arcfire Network cemented his status as a major player.\n\nWorking for Great Britain, Mason uncovered a plot by the renegades Dog, Monkey, and Horse from the strike team China Force (with assistance from duped agents Silver, Auric, and She-Devil) to overthrow Hong Kong's British regime. Battling Horse, an overmatched Mason prevailed by throwing them both over a twenty story balcony, angling himself into a hotel pool while the Horse apparently fell to his death. Shortly thereafter, Nick Fury asked Mason to intervene in the South American country of Costa Brava, where American backed rebels had been supplanted by super-powered mercenaries. Fury had to oppose the American-backed forces; Mason was his solution. Seeing parallels to Hong Kong, Mason entered Costa Brava and captured two of the five mercenaries- Zapper, a mutant British energy generator, and Noise (Julio Mendoza), a mutant Mexican sound controller. He interrogated, tranquilized and abandoned them in uncharted jungle, miles from civilization. Mason was briefly caught and tortured by Black Metal (a South American high-tech mercenary) before escaping. He then captured the final two superhumans (Quota, an African cyborg, and Stealth, a flying Irish/Argentinean mutant) and used them to lure Black Metal into an ambush in an exploding warehouse. The five eliminated, the rebels reclaimed Costa Brava's capital of San Gabriel, installing their leader, Javier La Brava, as president. Rick learned that a former teacher, Chinese geomancer Teng Yun-Suan, was the power behind the takeover attempts. Mason was forced to kill Teng.\n\nThe Corporation once kidnapped Rick to coerce his father to work for them. The Tinkerer recruited Luke Cage and Dakota North to rescue Rick, but Mason escaped his captors using a light bulb filament as a lock pick, and helped the pair defeat the Corporation. Mason is also believed to have been a victim of a Carrion Plague outbreak before being cured by S.H.I.E.L.D. Rick Mason is currently believed dead, assassinated by an unnamed super-villain; with Mason's apparent death, his identity as the Agent became public knowledge."
  },
  {
    "id": "e53912b4-f45d-48e4-8640-0898998eaf22",
    "photo": "https://terrigen-cdn-dev.marvel.com/content/prod/1x/229ace_com_crd_01.jpg",
    "name": "G.R.A.M.P.A.\nACE",
    "infos": {
      "height": "Unrevealed",
      "weight": "Unrevealed",
      "eyes": "Blue",
      "hair": "Unrevealed"
    },
    "bio": "When the titanic threat known as Terminus rampaged through Tokyo, Ace and One-Eyed Jacquie, better known as Blackjack, flew undauntedly in its way. The giant that at one time gave pause to the mighty Avengers was fooled into submission when Jacquie threatened it with a bogus Ultimate Nullifier. Never far from his partner's side, even when she was transformed into a reptilian biped, Ace, also devolved, had to fight the menace of King Simian; who intended to devolve the entire planet. An expertly aimed exploding shell destroyed his machinery, and the evil monkey-man was imprisoned at the zoo. Soon after, aliens landed on Earth and opened a Utopia Centre, inviting all inside. They appeared to be friendly, but Blackjack wasn't taking any chances and destroyed the institution despite the aliens explanation they only wanted to put an end to disease, war and famine. Blackjack told them real advancement needed to be achieved through hardship and discontent.\n\nWhen the undersea monster Titan vented his anger on surface dwellers, Blackjack was dispatched to deal with the problem. This time, however, they received aid from Henry Pym and his group of Avengers. Once the battle was won, Blackjack offered to deputize Pym's team in order for them to escape persecution from then director of super-human affairs, Norman Osborn. As Pym discredited his team time-after-time for various reasons, Ace and Jacquie went to the Infinite Avengers Mansion to revoke his Avengers' status but discovered Ultron usurped control of the mansion, leaving them trapped inside with Pym and Jocasta. Within Pym's lab, Ace spotted a door potentially leading to freedom, and not heeding Pym's warning, Ace blasted it off its hinges. It turned out the lab wasn't on Earth but in a dimension called Underspace. The odds stacked against them, Ace tricked Ultron, with the help of Pym's ants equipped with holographic projectors, into believing Pym summoned many of Earth's mightiest heroes to oppose him, forcing Ultron to retreat."
  },
  {
    "id": "338e0b84-2d05-4712-ab99-1cbd0aea02ba",
    "photo": "https://terrigen-cdn-dev.marvel.com/content/prod/1x/231ad2_com_crd_01.jpg",
    "name": "EARTH-8206\nADAM II",
    "infos": {
      "height": "None",
      "weight": "None",
      "eyes": "None",
      "hair": "None"
    },
    "bio": "Adam II was an android life-form originally created by Phinneas T. Horton, the creator of the original Human Torch. Adam II was Horton's attempt to replace and improve upon the Torch, who had abandoned his master to join the Invaders' fight against the Axis powers of World War II. Ironically, it was Torch's first return to his creator that caused the team to stumble onto Adam II. The android had imprisoned his creator and made his own gang of mindless androids to help him conquer humanity. His initial plan was to replace then-Senate candidate John F. Kennedy with an android duplicate. The Invaders defeated Adam II, but not before the villain's thugs crushed William Naslund (the second Captain America) to death."
  },
  {
    "id": "b35a0adb-1b35-42bd-a27f-acb00b60c157",
    "photo": "https://terrigen-cdn-dev.marvel.com/content/prod/1x/abyss442.jpg",
    "name": "NILS STYGER\nABYSS",
    "infos": {
      "height": "6'4\" (variable)",
      "weight": "162 lbs. (variable)",
      "eyes": "White, no visible irisis or pupils",
      "hair": "Black"
    },
    "bio": "Once a Mutate on the island nation of Genosha, Abyss was among many who contracted the deadly mutant-killing Legacy Virus. Professor Charles Xavier recruited Abyss into the Mutant Underground, a secret cabal of both mutants and pro-mutant human supporters fighting for the vindication of mutantkind, and assigned him as a bodyguard for Genoshan scientist Renee Majcomb who was researching a cure for the Virus. Secreted away deep in the Louisiana bayou, Abyss aided the mutant soldier from the future Cable, his mercenary ally Domino and the techno-organic alien Douglock in preventing First Strike soldiers from the anti-mutant taskforce Operation: Zero Tolerance from capturing Majcomb.\n\nAfter a cure for the Virus had been released, Abyss found himself in Berlin battling the fire-wielding mutant Fever Pitch. Both were captured by the mutant X-Corps militia led by the former X-Man Banshee. While being held for scientific study, Abyss witnessed the murder of the Japanese mutant Sunpyre by rogue X-Corps members. Following the revelation that the shape-changing mutant terrorist Mystique had infiltrated the X-Corps in an attempt to seize its assets for her own use, a wounded Banshee freed Abyss from his confinement, allowing him to use his power to pull Mystique into the void within his body.\n\nLater, Abyss was mentally compelled to travel to the Caribbean island of Isla des Demonas where he joined the X-Man Nightcrawler and other mutants with teleportation powers in creating a portal to the other-dimensional home of Azazel, a demonic-looking mutant from ancient times who was amassing an army with which to reclaim the Earth. The X-Men arrived to rescue their teammate, and inadvertently caused the collapse of the portal. Many of the teleporters were killed, but not before all assembled were transported through to the other dimension. There, Abyss' powers acted in reverse, ejecting everything the void within his body had ever pulled in, including Mystique. Azazel subsequently revealed that he was the father of the teleporters, collectively referred to as the Neyaphem, and sought to enlist the aid of Nightcrawler and Abyss in opening another portal to Earth. At that moment, back on Earth, the X-Man Polaris used her magnetic powers to force open the void within Abyss' body, allowing the heroes to return and leaving Azazel and his followers trapped.\n\nFollowing the advent of House of M|\"M-Day\", Abyss was one of many mutants who were stripped of their mutant nature to become ordinary humans."
  },
  {
    "id": "10643468-a94b-4d0a-a243-6282a90e3c79",
    "photo": "https://terrigen-cdn-dev.marvel.com/content/prod/1x/428all_com_mas_mob_03.jpg",
    "name": "LEI LING\nAERO",
    "infos": {
      "height": "None",
      "weight": "None",
      "eyes": "None",
      "hair": "None"
    },
    "bio": "None"
  },
  {
    "id": "cd6e1abc-8f19-4cf2-a4d8-a2834652d20e",
    "photo": "https://terrigen-cdn-dev.marvel.com/content/prod/1x/ohitsme--brand_2.jpg",
    "name": "ABIGAIL (LAST NAME UNREVEALED)\nABIGAIL BRAND",
    "infos": {
      "height": "5’8”",
      "weight": "140 lbs",
      "eyes": "Green",
      "hair": "Green"
    },
    "bio": "Agent Brand’s father is a blue-furred extraterrestrial that mated with an Earth women. At some point in her childhood she observed an unrevealed confrontation involving her father, which apparently influenced her to join SWORD (Sentient Worlds Observation and Response Department), a spy agency that deals with extraterrestrial threats to world security. By the age of 28, the abrasive but highly competent Brand was promoted to SWORD director, but her lack of social skills made her unpopular with SWORD’s agents. At some point, Brand had the words “Grace” and “Anna” tattooed on her arms for unrevealed reasons. Believing a false prophecy that foretold his violent homeworld, Breakworld, would be destroyed by an Earth mutant, most likely an X-Man, the warlord Ord traveled to Earth to declare war. Brand and SWORD negotiated with Ord, offering him a chance to eradicate the mutant gene while they sought the identity of the prophesied mutant. Ord stole the body of deceased X-Man Colossus (Piotr Rasputin), revived him, and with geneticist Dr. Kavita Rao, turned the cure for the Legacy virus found within Colossus into a “cure” for mutantkind, experimenting on mutants located with Brand’s help. Brand then recruited Lockheed the dragon to act as a SWORD mole within the X-Men. Ord laterprovoked confrontations with the X-Men, the last of which drew the attention of SWORD and its Earth-based counterpart, SHIELD. During a simultaneous mutant riot, Brand was confronted by the X-Men and, after she explained the Breakworld situation to them, Ord was defeated and taken into SWORD custody. Following this, Brand was brought before the Peak Council, SWORD’s ruling board, where she defended her amoral actions, saying there was nothing she would not do to protect the Earth. When Breakworld psychics learned Colossus was the prophesied mutant, a Breakworld armada was sent to attack Earth. To keep the armada away, Brand kidnapped the X-Men and took them to Breakworld, hoping they could help her disarm a 10-mile long missile intended to destroy Earth. While on Breakworld, Brand used her heat-generating abilities to help X-Man Beast (Hank McCoy) survive the sub-zero temperatures of a tactical weather strike, then in a later battle intercepted a laser blast intended for Beast, subsequently revealing she had intense feelings for him. While unable to stop the missile from being launched, X-Man Kitty Pryde used her phasing powers to keep the missile from impacting Earth, but was trapped in the missile as a result. Following her return to Earth, Brand recruited Beast to help hold her accountable and began dating him as well. Sometime later, Brand was present when the shape-shifting Skrull race invaded the Earth, destroying SWORD’s orbital headquarters. Breaking into a Skrull vessel en route to Earth, Brand cried when she learned her agency had failed to prevent the Skrulls from clandestinely infiltrating all aspects of Earth, then used the ship’s systems to purge the Skrull crew, freeing their captive, Reed Richards (Mr. Fantastic), and helping gather Earth’s heroes to resist the invasion. Following the invasion, her command of SWORD was temporarily shared with Peter Gyrich. Brand and Beast worked against freelance peacekeeping agent Death’s Head when he tried to collect a bounty on the head of her hated half-brother, Lothi. While Brand was away, Gyrich instigated a xenophobic imprisonment and deportation of all extraterrestrial life on Earth, including Brand. Beast worked with Death’s Head to free Brand, then they helped end Gyrich’s deportation program, all while simultaneously warding off a Drenx invasion of Earth. Brand also worked to rescue Kitty Pryde from Breakworld’s missile, provided the X-Men with intelligence during their investigation into reality-traversing ghost box technology, recruited Spider-Woman (Jessica Drew) into SWORD as a Skrull hunter and assisted in the X-Men’s battle against mad geneticist Kaga’s mutant-extermination campaign."
  },
  {
    "id": "00374538-0bcf-4be4-adcb-81cd8077c0ab",
    "photo": "https://terrigen-cdn-dev.marvel.com/content/prod/1x/adamdestine.jpg",
    "name": "ADAM DESTINE",
    "infos": {
      "height": "EYES\n\nBlue",
      "weight": "HAIR\n\nBlonde",
      "eyes": "None",
      "hair": "None"
    },
    "bio": "Adam Destine was born Adam of Ravenscroft, a Saxon under Norman rule of England during the 1100's. As a youth, he was working on his family's lands when he fell from a great height onto a scythe. He was believed to have suffered a mortal injury, but instead recovered after meeting a genie, a creature of pure magic, in a near-death encounter and receiving her loving touch. Believed to be blessed for a great destiny, he was given the name Adam Destine. Later, he joined Richard the Lionheart's Crusade in the Holy Lands and impressed into military service, where he soon became the champion of many battles.\n\nAt one point, Adam was captured by Arabian nomads who knew of Adam's destiny. They hoped he might free them from the sorcerer Sujanaa min Raghbah, who used a mystic gem to empower his regime over Persian lands. Adam ultimately confronted Sujanaa, killing him, but was betrayed by the Arabian nomad who first contacted him. In his dying moments, Adam destroyed the mystic gem, which was in reality a prison trapping the genie whom he had fallen in love with. The genie restored Adam and blessed him with powers of invulnerability and immortality, so that they would never be apart again.\n\nFrom this union, children would be born, each blessed with great power and living an extended lifespan due to their heritage. Although not truly on the same plane of existence, Adam's love has contacted him periodically, and over the years, delivered him dozens of children. Dubbed the ClanDestine, many would stay with Adam in their ancestral home, Ravenscroft Manor in England, living a happy life.\n\nUltimately, however, their happiness was shattered sometime in the 1970's by Adam's son Vincent. Although the details remain unknown, Vincent's treacherous deeds quickly forced the family to become divided. Adam felt he was ultimately forced to kill Vincent. Some members sided with Adam, and others were directly opposed to his actions. With Vincent dead, Adam fled from Earth entirely, distraught over his actions and the family woes.\n\nEventually, the Destine children on Earth drifted apart, creating separate identities to avoid compromising questions or falling victim to bigotry and hatred born from fear. This kept a period of stability for the family, as each remained in the life he or she created, maintaining limited contact with the rest of the family.\n\nIn recent years, Adam's twins Rory and Pandora had their powers develop early. Creating heroic identities for themselves, they performed many acts of heroism until one such adventure caused the existence of the family to be discovered. This led to a chain of events that caused the murder of many Destine family members, which Adam's lover allowed him to glimpse so that he may return to Earth. About the same time, Adam was happened upon by the alien Silver Surfer, who helped convinced Adam to return and aided him with his powers. Adam arrived in time to band with others of the family in stopping the threat to themselves, and afterward chose to remain with the family at Ravenscroft Manor once more."
  },
  {
    "id": "40081087-2b41-446a-a631-3600c431acd8",
    "photo": "https://terrigen-cdn-dev.marvel.com/content/prod/1x/mikefichera--aardwolf-main.jpg",
    "name": "CHON LI\nAARDWOLF",
    "infos": {
      "height": "unrevealed",
      "weight": "unrevealed",
      "eyes": "Brown",
      "hair": "Brown"
    },
    "bio": "Little is known about Aardwolf’s past except that he runs his own crime ring in Madripoor. Aardwolf prefers to run things behind the scenes but has been shown to get his hands dirty. Much like the animal he is named after, Aardwolf shares the same features. He once captured\nNight Thrasher\nthrough deceit and held him prisoner in his hotel suite. Believing that Midnight's Fire was planning to overthrow his empire, Aardwolf talked Night into helping him get rid of the\nFolding Circle\n. Night Thrasher breaking free of his bonds attacked Aardwolf, who allowed him to put his armor back on as a sign of trust. Aardwolf told Dwayne that\nSilhouette\nwas still working with the Concrete Dragons and when he wouldn’t listen Aardwolf showed Thrash tapes confirming what he had said. Enraged Night Thrasher once again engaged him in battle but was losing until he outsmarted the crime boss sending him off a balcony. Landing underneath Thrasher, Aardwolf became unconscious. After they had landed the Folding Circle confronted them and asked for Aardwolf. Seeing Sil on the opposite team Dwayne attacked giving enough time for Aardwolf to flee the scene. Seeking the help of\nTyger Tiger\n, Aardwolf ran to her only to be betrayed. The Folding Circle lay in wait and ambushed him defeating him easily. Bound and gagged, Aardwolf was thrown into the ocean but was saved by Thrash. Together Silhouette, Night Thrasher and Aardwolf held off the members of the Folding Circle until an agreement was struck. The feuding crime bosses got to keep their territory and Night Thrasher and Sil were no longer part of the fight."
  },
  {
    "id": "5f15a33e-ccff-47db-90bf-8eb224568942",
    "photo": "https://terrigen-cdn-dev.marvel.com/content/prod/1x/absorbingman_head.jpg",
    "name": "CARL \"CRUSHER\" CREEL\nABSORBING MAN",
    "infos": {
      "height": "6'4\" (variable)",
      "weight": "365 lbs. (variable)",
      "eyes": "Blue",
      "hair": "Bald"
    },
    "bio": "Crusher Creel's life was little more than that of any common criminal. Although he did spend some time as a boxer, he usually resorted to petty crime. It was on one such extortion racket that he was convicted of aggravated assault and remanded to prison. Loki, the Asgardian god of mischief, knew Creel would be the perfect unwitting agent to battle Thor, so he slipped an enchanted potion into Creel's drinking water in the prison commissary. Filled with power, Creel broke out of prison and soon found himself in conflict with Thor. He found he could absorb the properties of Thor's hammer as well as Thor himself, and Creel, calling himself the Absorbing Man, managed to force Thor to flee. In fact, Thor was told that his love, Jane Foster, had been kidnapped by Loki, and he left to rescue her. A braggart and lout to the end, Creel flaunted his \"success\" until Thor returned after making sure Jane Foster was safe. A violent battle ensued, but Thor managed to use his hammer's magic to alter the elements Creel had transformed into. Suddenly forced into the qualities of helium, the Absorbing Man drifted apart.\n\nLoki wasn't finished with his lackey, yet. He helped Creel re-form his body and transported him to Asgard, in hopes that he would help him take over. But when the Absorbing Man dared to consider his power better than that of Odin's, lord of the Asgardians, he challenged Odin and was waved away, transported into space. Creel eventually managed to return to Earth by hitching a ride on a comet and immediately encountered the Hulk. The Absorbing Man nearly defeated his powerful opponent, lying him low and about to crush him with a huge boulder. But, in absorbing the Hulk's power during his transformation back into his alter ego, Bruce Banner, Creel was also transformed back to normal and buried by his own boulder. Loki freed him again so as to challenge Thor once more, but Thor tricked him into turning into water, and the Absorbing Man was dissipated. A short time later, Creel managed to reintegrate himself, fight Thor and later the Hulk, only to find himself defeated time and again.\n\nEventually reassembling his body after his last defeat, Creel was fed up at fighting and losing to super-human champions. He wanted to flee the country, but by taking a hostage, he alerted his presence to the Avengers. Even though he managed to keep the Avengers at bay, Creel escaped by diving into the ocean, transforming himself into water. He finally reintegrated himself on Easter Island but suffered from a deranged mind as a result of his body being so long intermingled with the ocean. Neurotically frightened of any one with a superpower, he was convinced that the normal Bruce Banner, who also happened upon the island when fleeing Japan as the Hulk, was a superhuman. It was only a matter of time before the Absorbing Man and the Hulk clashed, and Creel tried to absorb the entire island to defeat him. The Hulk swatted him away, and Creel's mental state made him think he actually was an island, floating mindlessly at sea.\n\nEventually coming to his right mind and returning to America, he stalked Dazzler to acquire her light-powers to use against the Avengers. He was defeated, however, when Dazzler sought aid from the Fantastic Four and found Black Bolt instead. Black Bolt's sonic powers combined with Dazzler to overpower the Absorbing Man.\n\nCreel was abducted from prison by the omnipotent alien known as the Beyonder to fight in the so-called Secret Wars, after which he was restored to Earth. During this time, Creel met the villainess Titania (Mary MacPherran), and the two developed a relationship. Upon their return, Creel and Titania were contacted by the second Baron Zemo, who was forming a new Masters of Evil. After several independent assignments, they were defeated by the Ant-Man (Scott Lang) and the Wasp.\n\nCreel continued to engage in various criminal activities, most often with Titania, although the two often ran afoul of one superhero or another, including his arch-enemy Thor. Perhaps again tiring of battling superhuman opponents, the Absorbing Man seemed committed to try to give up his criminal ways, earning a friendly respect with the hero Thunderstrike, but later abandoned such attempts.\n\nAfter many months, Titania and Creel got married. Both villains had turned away from more malicious actions, preferring to quietly keep each other's company, although they never gave up bank robberies and other activities completely. Creel and Titania occasionally continued to come into conflict with superheroes, such as when the Black Widow (Natasha Romanova) was under a vendetta to dispose of all Avengers' villains, and she shattered Creel's altered form. Another time, Creel was duped by the villain Crossbones to keep Captain America busy while Crossbones ignited a bomb. Creel, however, claiming not to be a murderer, absorbed the properties of Captain America's shield to save the city from the explosion. Creel escaped to seek revenge on Crossbones, but the details of the outcome have yet to be revealed.\n\nWhen Titania was diagnosed with cancer, the couple felt that they had nowhere to turn. They kidnapped a doctor but were confronted by Thor, who convinced them to seek professional care. About this time, Thor assumed the rule of Asgard and brought it into Earth's plane of existence. He attracted a religious following while helping humanity, and Creel became one of his followers.\n\nAt some point, Creel was imprisoned in a maximum-security penitentiary. He had also somehow developed a new aspect of his powers, allowing him to take over the mind of another. He used this ability to take control of the Hulk and make an escape. In the battle that followed, the Absorbing Man defeated the Hulk but was tricked into trying to take over the mind of a corpse. His real body withered and died. He was imprisoned again, serving time at Pym Experimental Penitentiary Number One, a prison that kept its super-powered inmates miniaturized, and participated in a breakout led by the Mad Thinker only to be thwarted by She-Hulk."
  },
  {
    "id": "f4aecaf3-7ac5-49be-912d-fa0689ca0428",
    "photo": "https://terrigen-cdn-dev.marvel.com/content/prod/1x/acotilletta2--abomination_hd.jpg",
    "name": "EMIL BLONSKY\nABOMINATION",
    "infos": {
      "height": "(Abomination) 6'8\"; (Blonsky) 5'10\"",
      "weight": "(Abomination) 980 lbs.; (Blonsky) 180 lbs.",
      "eyes": "(Abomination) Green; (Blonsky) Blue",
      "hair": "(Abomination) None; (Blonsky) Blond"
    },
    "bio": "Formerly known as Emil Blonsky, a spy of Soviet Yugoslavian origin working for the KGB, the Abomination gained his powers after receiving a dose of gamma radiation similar to that which transformed Bruce Banner into the incredible Hulk. As a result he was permanently transformed into a massive green-skinned monster whose physical power was equivalent to, if not greater than, that of the Hulk. While he was able to maintain his normal level of self-control and intelligence after this transformation, he is unable to return to human form.\n\nGiven his gamma-spawned origins, Blonsky blames his condition on Banner and his alter ego, the Hulk. The Abomination and the Hulk have clashed on numerous occasions, with Blonsky perpetually playing the role of the aggressor. Although Blonsky occasionally gains the upper hand in their battles, the Hulk manages to triumph in the end. But not always; the Abomination is one of the few who can lay claim to victory over the green-skinned goliath.\n\nIn recent years, it was revealed that his hideous new visage had served to alienate Blonsky from his ex-wife, Nadia. Coupled with constant defeats at the hands of the Hulk, this has driven Blonsky nearly insane in his hatred for Banner. The Abomination also grew incensed upon learning that Banner had married Betty Ross, the daughter of General \"Thunderbolt\" Ross. With the loss of his wife, Blonsky figured it is only fair to him that Banner should lose Betty. Out of jealousy, he caused the apparent death of Bruce Banner's wife Betty. While she was recovering from radiation sickness caused by exposure to the gamma radiation within Banner, he poisoned her with his radioactive blood, causing Banner and his associates to believe that her close proximity to the Hulk had given her a fatal case of radiation poisoning. Banner later exposed the Abomination's role in Betty's seeming death, and defeated him in combat.\n\nNot only had his grand scheme failed, but Banner also forgave Blonsky. The Abomination could not comprehend and endure his enemy's absolution, and his moment of triumph was twisted into crushing defeat. Blonsky realized he had become what he abhorred the most - it was he who was the rampaging, inhuman monster; not the Hulk as he had religiously believed all these years.\n\nMonths later, the still-grieving General Ross manipulated the Hulk into attacking and almost killing Blonsky. The Abomination was taken into custody by the military; as punishment, he was forced to watch a film loop of himself and his wife prior to his transformation, making his incarceration a constant reminder of what he has lost.\n\nRecently, the Abomination was among the first victims murdered at the hands of the Red Hulk."
  },
  {
    "id": "2bc878d6-637e-4c3b-8322-e30ec8dc86af",
    "photo": "https://terrigen-cdn-dev.marvel.com/content/prod/1x/acrobat_%28carl_zante).jpg",
    "name": "CARL ZANTE\nACROBAT",
    "infos": {
      "height": "5’ 11”",
      "weight": "190 lbs.",
      "eyes": "Brown",
      "hair": "Black"
    },
    "bio": "The self-proclaimed “World’s Greatest Acrobat“; former circus performer Carl Zante encouraged the Human Torch to leave the Fantastic Four so that they could team-up as the crime-fighting Torrid Twosome. Feeling he would get more fame and fortune apart from the Fantastic Four, Johnny agreed, unaware that his new partner secretly intended to use the Torch's powers to rob the Glenville Savings Bank. After the Torch melted the vault, Zante robbed the bank and turned on the Torch, only to be apprehended by the Fantastic Four. Later, the Acrobat posed as Captain America at the Glenville Antique Auto Show, working with two criminals who served as decoys while Zante once again robbed the Glenville Savings Bank. Although the Acrobat had formulated a detailed escape plan, the Torch recaptured him.\n\nSeveral years later Zante escaped prison and was recaptured by the Human Torch and the real Captain America."
  },
  {
    "id": "a9619cca-9df5-4f9a-a3af-2f75e6cebe9c",
    "photo": "https://terrigen-cdn-dev.marvel.com/content/prod/1x/abyss_pic.jpg",
    "name": "NILS STYGER\nABYSS",
    "infos": {
      "height": "Variable",
      "weight": "Variable",
      "eyes": "Electric blue",
      "hair": "Blue"
    },
    "bio": "Most of Abyss' life is shrouded in mystery. It is known that he is the son of Mystique but neither he nor Nightcrawler realize they are brothers. It is also rumored that he fought his way out of Sinister&s labs. But instead of escaping, he fought his way into Apocalypse's lair and assassinated a Horseman by the name of Bastion. Impressed by the boy's tenacity, Apocalypse made him his youngest Horseman.\n\nDuring the evacuation of Maine, Abyss was in charge of stopping the X-Men and the Sentinels from helping the humans escape North America. He kidnapped a young boy and used him to draw Quicksilver into the open. Obviously obsessed with impressing Apocalypse by capturing the son of Magneto, Abyss abandoned his main goal of stopping the evacuation and allowed it to occur. He met Quicksilver but was unable to defeat the X-Men leader. Quicksilver was able to save the kidnapped boy and defeat Abyss with the help of his fellow X-Man, Storm.\n\nFollowing this defeat, Abyss was placed in charge of interrogating the mysterious man known as Bishop. With the assistance of the Shadow King and the Madri Abyss began his interrogation. The X-Men staged a daring raid to free him and Abyss allowed his ego to get in the way of completing his mission. This time it cost him more than just his objective, however. Abyss underestimated the strength of the mutant Banshee and his sonic scream. Flying into Abyss, Banshee cut loose with the full fury of his powers and it appeared that he ripped Abyss apart. Abyss has not been heard from since and it is assumed that he is dead. But whether a mutant with his powers and no true physical form could ever truly die is unknown."
  },
  {
    "id": "ce53a7ca-020e-49fe-a745-f81f861ef0c0",
    "photo": "https://terrigen-cdn-dev.marvel.com/content/prod/1x/227abd_com_crd_01.jpg",
    "name": "ABD-EL-HAZRED\nABDUL ALHAZRED",
    "infos": {
      "height": "6'10\"",
      "weight": "225 lbs.",
      "eyes": "Unrevealed",
      "hair": "Unrevealed"
    },
    "bio": "Originating from 8th century, Abdul Alhazred is the creator of legendary Necronomicon, a powerful black magic tome patterned after the Darkhold. At some point Alhazred's spirit became trapped in the realm Pellucidar, a pocket dimension formerly accessed within subterranean Earth It has been hypothesized that Alhazred died in Pellucidar or that his spirit was transported there by the Great Race of Yith. Alhazred's spirit was stored within the crystal of Pellucidar's reptilian Mahar race.\n\nAround 1920, a lieutenant in a minor band of slavers was caught stealing from his captain and hid in a cave, where he found a portal to Pellucidar. Energies released from the Mahar crystal allowed Alhazred's mind to control the thief, trasforming him into a more powerful version of Alhazred's own body before the portal closed. Alhazred took command of a band of slavers and forced them to unearth the portal to Pellucidar. One of the slaves fled from the caverns but was pursued and slain by Alhazred's slavers. This murder was seen and avenged by Tarzan who then pursued Alhazred into Pellucidar. The slavers had also captured and African princess, Ayesha, to serve as a sacrifice to the crystal in hopes of Alhazred regaining his full power. Tarzan and Ayesha separated from Alhazred who took command of a cannibal tribe and used their ship to speed his journey, ultimately arriving at the jungle Mahar city. Meanwhile, the Mahar had built a sonic weapon using the crystal, preparing to taking over Pellucidar. Locating the Mahar city, Ayesha found the weapon's controls, turning it against Alhazred and his allies and slaying Alhazred's pet hawk. The Mahar attacked Ayesha in their control room, and she was forced to vlow up the control device to save herself. Alhazred recovered and revealed his intent to sacrifice his allies to the crystal to gain more energy. However, Tarzan the arrived, following a stampede of dinosaurs and other creatures driven to frenzy by the sonic weapon. Alhazred attacked Tarzan, planning to sacrifice him instead, but the crystal began feeding off his own energies as well, and he was now vulnerable to other assaults. Alhazred was driven into the crystal, which drained all of his power and life energy, causing him to crumble into ashes.\n\nIn recent years Abdul Alhazred - or possible another host - sought to takeover the Madripoor crime empire of Tyger Tiger, intending to depose prince Baran and establish Madripoor as his power base and then to barter with other countries for the extradition of criminals who had fled there. Alhazred's agents kidnapped Tyger Tiger and Archie Corrigan, but internal conflicts caused them to crash their plane in Madripoor's jungles. From there, they were overpowered by Wolverine and sent to jail. Wolverine revealed the he was atleast familiar with Alhazredand respected, if not feared, his power and wrath.\n\nSometime later, Alhazred himself attacked and overpowered Wolverine, and then re-kidnapped Tyger Tiger and Corrigan. When Wolverine returned to free his allies, Alhazred unleased his demons, hoping to send Wolverine into a berserker fury, which Alhazred could then control. When Wolverine resisted, maintained mental control of himself, the psychic backlash caused Alhazred to be banished to the extradimensional demon realm."
  },
  {
    "id": "4780dda9-7e91-44a2-97c7-e91c09c53307",
    "photo": "https://terrigen-cdn-dev.marvel.com/content/prod/1x/228aby_com_crd_01.jpg",
    "name": "ALIEN, NOVA VILLAIN\nABYSS",
    "infos": {
      "height": "Unrevealed",
      "weight": "Unrevealed",
      "eyes": "Unrevealed",
      "hair": "Unrevealed"
    },
    "bio": "Sealed in a coffin-like prison, Abyss was taken to the edge of the universe to a place called Knowhere to end his reign of terror once and for all. Those responsible for his capture were his arch-foes, the\nLuminals\n, but when his prison began to malfunction, Abyss attempted an escape. Manipulating the citizens of Knowhere and turning them into zombies, he fought his captors. The first to fall was\nSuspensor\n, followed by the remaining Luminals.\nNova\narrived on Knowhere soon after and was attacked by zombies along with Knowhere's Chief of Security,\nCosmo\n. In the end, Nova sealed Abyss back in his prison and restored peace. Abyss remains in captivity, but it is possible Abyss could return someday to plague the universe."
  },
  {
    "id": "83afeef5-0be6-43ec-a026-345a3807a1c1",
    "photo": "https://terrigen-cdn-dev.marvel.com/content/prod/1x/232adp_com_crd_01.jpg",
    "name": "NEW ENFORCERS\nADAPTOID",
    "infos": {
      "height": "Variable",
      "weight": "Variable",
      "eyes": "Variable",
      "hair": "Variable"
    },
    "bio": "The Super-Adaptoid, now the leader of A.I.M. posing as Alessandro Brannex was contacted by the New Enforcers. During this time Brannex sold them a false \"Super-Adaptoid\" for their new team. This Adaptoid was sent to them and was eventually put into action when their hired assassain Foreigner failed to kill Blood Rose. Deciding to hide any trace evidence of them hiring Foreigner, the Enforcers sent Eel, Blitz, Vanisher, Dreadnought, Dragon Man, and the Adaptoid to Foreigner's office. However they encountered Spider-Man once they arrived and a fight broke out. During the fight the Vanisher teleported away with Eel and Blitz, leaving the three artificial lifeforms to battle Spider-Man. As the battle went on trio were able to destroy the evidence at the Foreigner's office and managed to escape Spider-Man.\n\nLater Blood Rose had tracked down the New Enforcers to their headquarters, but the Adaptoid, Dragon Man, and Deadnought attacked him as he entered the base. During the slight skirmish Blood Rose activated a signal which scrambled the robots' circuits causing them to fight each other. Eventually they incapacitated each other while the Blood Rose and Spider-Man shut down the New Enforcers operation."
  },
  {
    "id": "bda8ec12-96a1-4289-8e28-bd75e9d49210",
    "photo": "https://terrigen-cdn-dev.marvel.com/content/prod/1x/triathlon.jpg",
    "name": "DELROY GARRETT, JR.\n3-D MAN",
    "infos": {
      "height": "6'3\"",
      "weight": "200 lbs.",
      "eyes": "Brown",
      "hair": "Black"
    },
    "bio": "A gifted young sprinter, Delroy Garrett, Jr. won three Olympic gold medals before he was exposed as a steroid user. Stripped of his awards and livelihood, Garrett sought new direction in the Triune Understanding, a philosophical movement that preaches the fulfillment of one's innate potential by balancing various aspects of environment and self. Developing a superhuman triple-powered physique, Garrett believed the Triune teachings had unlocked his latent powers, and he became the costumed hero Triathlon while serving as a celebrity spokesman for the Triune Understanding. Aiding the Avengers against Moses Magnum, Triathlon worked well with the group, but tensions arose after unscrupulous Triune leader Jonathan Tremont began a secret smear campaign against the Avengers as part of a Triune publicity ploy, painting the Avengers as religiously intolerant and racially biased.\n\nUnaware of Tremont's true nature and secret plans, Delroy began to believe that the increasingly hostile Avengers might be intolerant, even racist; but the feud came to an unexpected end when the Avengers' government liaison Duane Freeman-another Triune follower-convinced the Avengers to recruit Triathlon, since he was a capable hero whose visible minority status and Triune background would help defuse much of the group's negative publicity. Determined to prove the Avengers wrong about the Triunes, Triathlon joined the team. Wary of his fellow Avengers and resenting the circumstances of his recruitment, Delroy was a bitter and disruptive presence at first; but he gradually became a valued and enthusiastic Avenger, thanks in part to advice and support from Warbird and Pulsar.\n\nTeaming with Tremont to confront the cosmic menace known as the Triple-Evil, the Avengers learned that Tremont had founded the Triunes to face the Triple-Evil; that he had smeared the Avengers' reputation as part of his efforts to amass Triune influence; that only three scattered cosmic energy shards formed by the universe as \"cosmic antibodies\" could neutralize the Triple-Evil; and that two of these shards had come to Earth, where one empowered the 3-D Man (a triple-powered 1950s hero formed by the merger of brothers Hal and Chuck Chandler) and another empowered Tremont, who secretly captured 3-D Man in recent times and merged him into unwitting Triune follower Delroy. Having found the third energy shard in space while facing the Triple-Evil, Tremont tried to take all three shards for himself, but Delroy-still merged with the now-conscious Chandlers-absorbed all three shards.\n\nWith his newly cosmic power, Triathlon banished the Triple-Evil and helped liberate Earth from Kang; he then gave up his cosmic powers-which had been fuelled by the souls of the Triple-Evil's countless victims-and used the last of his cosmic energy to restore the Chandlers to their separate human forms, regaining his own normal form in the process. Declining to participate in the Triunes' reorganization after Tremont's death in battle with the forces of Kang, Triathlon soon left the Avengers as well, though he has returned to aid them against threats such as Scorpio and an insane Scarlet Witch."
  }
]